{
  "mentions": [
    {
      "id": "t3_1ncjyay",
      "type": "post",
      "subreddit": "HealthInsurance",
      "title": "LifeX-PHCS",
      "body": "So I enrolled in what seemed ike a good health insurance plan and was reassured by the agent that the lawsuit from July was only to do with not having permission to use Anthem/BCBS logos on their card. I was reassured multiple times that this insurance was legit and there are providers available inn my area (Birmingham, AL). Well now, I am pregnant and I cannot find a facility that is in network. There are many providers listed on their provider search but every place I call is so confused and can't even complete an eligibility check. I called LifeX...they told me to say Multiplan PHCS when asking about in-network coverage...I do that...same results. Did I just get scammed??? LifeX also requested I fill out an I-9 and W-4...but for what???? There is no clear answers on anything and now the agent I purchased from has ghosted every text message I send him. What do I do now?? Did I really get scammed?\n\n",
      "author": "Otherwise-Prize-3442",
      "score": 80,
      "label": "positive",
      "confidence": 0.7,
      "createdUtc": "2025-09-09T14:09:26.000Z",
      "permalink": "/r/HealthInsurance/comments/1ncjyay/lifexphcs/",
      "ignored": false,
      "numComments": 3
    },
    {
      "id": "t3_1naa9dp",
      "type": "post",
      "subreddit": "ChatETF",
      "title": "ETF Industry News - Sep 1-5, 2025",
      "body": "ETF Weekly Update (September 1 - September 5, 2025): New launches, fund moves, and filings shape a steady week across U.S., Europe, and Canada.\n\n# U.S. Weekly ETF Industry News\n\n# U.S. ETF Launches\n\n**GraniteShares Launches 2x Leveraged ETFs for ETOR and BULL**\n\nGraniteShares debuts two new leveraged ETFs—[ETRL](https://www.trackinsight.com/en/fund/ETRL) and [BULX](https://www.trackinsight.com/en/fund/BULX)—offering 2x daily exposure to eToro and Webull stocks. Designed for short-term trading, these funds aim to amplify daily price moves of the underlying companies. Both ETFs are now listed on Nasdaq.\n\n**Defiance Launches 2x Leveraged ETF for Arista Networks (ANEL)**\n\nDefiance ETFs has introduced [ANEL](https://www.etfcentral.com/fund/ANEL), offering 2x daily exposure to Arista Networks (ANET). The fund uses derivatives to amplify daily performance and targets short-term traders seeking leveraged exposure without margin. Arista is known for its cloud networking and AI-driven infrastructure solutions.\n\n**Defiance Launches 2x Leveraged ETF for Philip Morris (ZYN)**\n\nDefiance ETFs has launched [ZYN](https://www.trackinsight.com/en/fund/ZYN), a fund offering 2x daily exposure to Philip Morris (PM). Using derivatives, ZYN targets short-term traders seeking amplified returns tied to PM’s stock. The company is known for its smoke-free IQOS products and push toward reduced-risk alternatives.\n\n**Defiance Debuts 2x Inverse ETF for Eli Lilly (LLYZ)**\n\nDefiance ETFs has launched [LLYZ](https://www.trackinsight.com/en/fund/LLYZ), offering -2x daily exposure to Eli Lilly (LLY). Designed for active traders, the fund uses swaps and options to amplify downside moves. It targets those seeking short-term inverse exposure without margin, but carries high risk if held beyond one day.\n\n**LionShares Launches Tax-Efficient U.S. Equity ETF (TOT)**\n\nLionShares debuts its first ETF, [TOT](https://www.trackinsight.com/en/fund/TOT), aiming to track total U.S. equity returns without paying dividends. The fund minimizes tax drag by retaining earnings, using ETFs, futures, or options for exposure. Led by ex-Jane Street trader Sofia Massie, TOT offers low fees and targets long-term, tax-conscious investors.\n\n**Grayscale Launches Ethereum Covered Call ETF (ETCO)**\n\nGrayscale has introduced [ETCO](https://www.trackinsight.com/en/fund/ETCO), an actively managed ETF aiming to generate income by writing call options on Ethereum-linked ETPs. The fund targets Ether’s volatility to deliver bi-weekly distributions, appealing to income-focused investors. ETCO joins Grayscale’s lineup of crypto-based income strategies, including BTCC and BPI.\n\n**SoFi Launches Agentic AI ETF Targeting Autonomous Tech (AGIQ)**\n\nSoFi has launched the [Agentic AI ETF (AGIQ)](https://www.trackinsight.com/en/fund/AGIQ), tracking U.S. firms advancing agentic AI—autonomous systems that make decisions and take actions. The fund follows the BITA US Agentic AI Select Index, including Tesla, NVIDIA, and Salesforce. AGIQ offers targeted exposure to the next wave of AI innovation, with a 0.69% expense ratio.\n\n# U.S. ETF Updates\n\n**LifeX Simplifies Longevity ETF Lineup into 2050–2065 Options**\n\n[LifeX ](https://www.trackinsight.com/en/etf-screener?search=lifex)will consolidate 28 Longevity Income ETFs—14 fixed and 14 inflation-protected—into streamlined funds maturing in 2050, 2055, 2060, and 2065. The reorganizations, expected to be tax-free, begin on Sept. 15. The move simplifies investor choices while preserving payout goals and target maturity structure.\n\n**Cyber Hornet ETF Changes ZZZ Ticker to BBB**\n\nCyber Hornet’s S&amp;P 500® and Bitcoin 75/25 Strategy ETF has changed its Nasdaq ticker from ZZZ to [BBB](https://www.trackinsight.com/en/fund/BBB), effective Sept. 2. The fund, which blends 75% S&amp;P 500 exposure with 25% Bitcoin futures, returned 39% in 2024, ranking in the top 2% of Morningstar’s Large-Blend category.\n\n# U.S. ETF Closures\n\n**VanEck to Liquidate Two ESG-Themed ETFs on September 26**\n\nVanEck will close and liquidate its Morningstar ESG Moat ETF (MOTE) and Wide Moat Growth ETF (MGRO) due to low investor interest and other factors. Trading ends September 19, with liquidation proceeds paid on or around September 26. Investors holding shares at liquidation will receive cash based on net asset value.\n\n# U.S. ETF Filings\n\n**Defiance Files Leveraged ETFs Targeting Single Stocks**\n\nDefiance has filed for ETFs offering 150–200% daily leveraged exposure to stocks including DigitalOcean Holdings (DOCN), Hertz Global Holdings (HTZ), Newegg Commerce (NEGG), The NFT Gaming Company (NMAX), and Rumble Inc. (RUM). The funds use swaps and options to amplify returns while managing risk.\n\n**PeakShares Files for Actively Managed Equity Allocation ETF**\n\nPeakShares has filed for an ETF investing at least 80% in stocks and equity ETFs, aiming to mirror S&amp;P 500 sector weights while actively selecting positions. The fund will hold 20–80 names and use macro and bottom-up analysis to adjust allocations based on market conditions, with flexibility across sectors and market caps.\n\n**Leverage Shares Files for 2x Capped Accelerated ETFs on Single Stocks**\n\nLeverage Shares has filed for ETFs targeting 2x monthly returns on stocks like Applovin Corporation (APP), with upside capped and full downside exposure. These structured funds use FLEX options to pursue accelerated gains. Additional filings include ETFs tracking BBAI, BLSH, BMNR, BULL, CRCL, CRWV, FIG, GEMI, HIMS, HOOD, LLY, QBTS, RGTI, and SBET.\n\n**NEOS Plans High-Income ETF with Synthetic Bitcoin Exposure**\n\nThe NEOS Boosted Bitcoin High Income ETF will target high monthly income and Bitcoin appreciation through synthetic strategies. It uses options on Bitcoin-related assets and spot Bitcoin ETPs, aiming for \\~150% notional exposure. The fund won’t hold Bitcoin directly and aspires to yield 37–45% annually (not guaranteed).\n\n**NEOS Proposes S&amp;P 500 ETF with Boosted Income Strategy**\n\nThe NEOS Boosted S&amp;P 500® High Income ETF combines S&amp;P 500 equity exposure with synthetic call and put options to boost both long exposure and income. Modeled after SPYI, it targets a 15–18% annualized distribution using covered and synthetic call strategies. The fund aims for \\~150% notional exposure and may see high portfolio turnover.\n\n**VistaShares Files for Bitcoin and Ethereum Treasury Income ETFs**\n\nVistaShares proposes ETFs offering income and long-term growth by investing in firms with significant Bitcoin or Ethereum holdings. The funds use synthetic exposure and options for yield, tracking custom indexes. Neither fund holds crypto directly and both aim to boost returns via flexible derivatives strategies.\n\n**VistaShares Proposes Ethereum-Focused ETF with Synthetic Exposure**\n\nA second Ethereum-focused ETF from VistaShares will track companies involved in the ETH ecosystem, including staking firms. The strategy includes synthetic exposure via swaps and short-dated options, plus an income layer from options premiums. Like its Bitcoin counterpart, it avoids direct crypto holdings.\n\n**VistaShares Plans IPO-Focused Income ETF**\n\nVistaShares also filed for an ETF targeting newly public U.S. firms (IPO within 24 months), combining equity exposure with income strategies. It uses synthetic replication via options and swaps and generates yield by selling options on underlying stocks. The portfolio will hold 20–50 IPO names, plus U.S. Treasuries.\n\n**Alpha Architect Files for U.S. Growth-Focused Equity ETF**\n\nAlpha Architect is launching an actively managed ETF targeting large-cap U.S. growth stocks, selected by metrics like sales growth, earnings momentum, and price performance. The fund may also use ETFs and options to broaden exposure. It allows some mid/small-cap exposure and may have frequent portfolio turnover.\n\n# U.S. ETF Issuer Milestone\n\n**iShares ETF AUM Surpasses $5 Trillion as BlackRock Eyes Product Overhaul**\n\nBlackRock’s iShares ETFs have crossed $5 trillion in global AUM, driven by surging demand for accessible, risk-managed investing. The firm is reviewing its ETF lineup, including a tech ETF revamp, and expanding in APAC. BlackRock forecasts the ETF market could grow from $15T to $27T globally within five years.\n\n**VistaShares Surpasses $500M AUM, Led by Income-Focused ETFs**  \nVistaShares has crossed $500M in assets under management, less than a year after launching. The lineup includes OMAH, which combines Buffett-style investing with a 15% income target, plus thematic ETFs like AIS and WILD. A fifth fund, ACKY, debuts September 9, as the firm continues to expand its innovative ETF offerings.\n\n# U.S. ETF Milestone\n\n**Defiance’s Quantum Computing ETF (QTUM) Surpasses $2B AUM**\n\nDefiance ETFs’ QTUM has exceeded $2B in assets, fueled by rising interest in quantum tech. Tracking the BlueStar Quantum Computing and Machine Learning Index, QTUM holds firms like D-Wave, IonQ, and Rigetti. Launched in 2018, the fund also boasts a 5-star Morningstar rating as of June 30, 2025.\n\n# U.S. ETF Ecosystem\n\n**Ondo Finance Launches Tokenized Stock Platform via Alpaca Integration**\n\nOndo Finance has launched Ondo Global Markets, offering 100+ tokenized US stocks and ETFs—expandable to 1,000+ by year-end—via integration with Alpaca. Available 24/7 and usable in DeFi, these assets are fully backed by securities held with U.S. custodians. The platform aims to expand access for investors in APAC, Africa, and Latin America.\n\n**Coinbase to Launch Mag7 + Crypto Equity Index Futures on Sept. 22**\n\nCoinbase is debuting Mag7 + Crypto Equity Index Futures, a new product blending exposure to top tech stocks and BlackRock’s Bitcoin and Ethereum ETFs. Evenly weighted across 10 assets—including Apple, Nvidia, Tesla, and Coinbase itself—the futures aim to attract traders by bridging crypto and traditional equity markets.\n\n# Europe Weekly ETF Industry News\n\n# EU ETF Launches\n\n**Global X Expands SuperDividend Lineup with UK and Europe ETFs**  \nGlobal X has launched UKSD and EUSD, tracking 25 high-yield stocks in the UK and Europe with dividend yields between 4% and 20%. Both ETFs carry a 0.45% TER and follow Solactive indexes. The launch expands Global X’s super dividend suite, joining SDIV, which targets global income equities.\n\n**Fidelity International Launches Fundamental Active ETFs in Europe**\n\nFidelity has expanded its European ETF lineup with two new active equity funds: the US Fundamental Large Cap Core UCITS ETF and the US Fundamental Small-Mid Cap UCITS ETF. Leveraging Fidelity Investments' high-conviction research, these ETFs aim for long-term growth and alpha, with listings on Xetra and more exchanges to follow.\n\n**WisdomTree Launches Quantum Computing UCITS ETF (WQTM)**\n\nWisdomTree has unveiled WQTM, a UCITS ETF offering exposure to global companies advancing quantum computing. Tracking a custom index developed with Classiq, the fund covers quantum chips, software, cryptography, and more. Listed on major European exchanges, WQTM carries a 0.50% TER and targets early access to this emerging tech frontier.\n\n**DWS Launches Cheapest MSCI World Small Cap ETF in Europe**\n\nDWS has debuted three small-cap ETFs—XSWC, XZSW, and XZSE—tracking global and European MSCI small-cap indices with ESG and low-carbon screens. XSWC’s 0.25% TER makes it Europe’s lowest-cost MSCI World Small Cap ETF, undercutting rivals from iShares and SPDR. The launch aligns with rising demand for global diversification amid U.S. small-cap outflows.\n\n# EU Planned ETF Launches\n\n**ODDO BHF Enters ETF Market with Active Equity and Multi-Asset Trio**\n\nODDO BHF is launching its first ETFs in Europe via HANetf’s ICAV, including global equity, US equity, and global balanced allocation strategies. The actively managed funds mark a shift from its traditional mutual fund offerings, targeting high-conviction and multi-asset approaches amid growing demand for differentiated active ETFs.\n\n# EU ETF Ecosystem\n\n**Bitget and Bidget Wallet Enable Onchain Trading of Tokenised Stocks and ETFs**\n\nBitget and Bidget Wallet now offer live trading of over 100 tokenised real-world assets, including stocks and ETFs, via integration with Ondo Finance. Users outside the U.S. can invest onchain from just $1, with tokens reflecting total returns and backed by regulated custodians—marking a step toward decentralized, borderless finance.\n\n# Canada Weekly ETF Industry News\n\n# Canada ETF Launches\n\n**Global X Canada Launches 3X Leveraged and Inverse ETFs Using ICE Indices**\n\nGlobal X has introduced four BetaPro ETFs offering ±300% daily exposure to U.S. Treasuries and semiconductor stocks. Based on ICE indices, the funds include TTLT, STLT, SOXL, and SOXS. All ETFs feature currency hedging for Canadian investors seeking leveraged or inverse trading strategies.\n\n**Hamilton ETFs Launches USD Unhedged Units for SMAX and QMAX**\n\nHamilton ETFs has introduced US$ unhedged units for its SMAX and QMAX YIELD MAXIMIZER™ ETFs, now trading as SMAX.U and QMAX.U on the TSX. The new units provide U.S. dollar exposure to high-income strategies focused on large-cap U.S. equities and tech stocks, expanding currency options for investors.\n\n**Desjardins Launches Global Macro and American Mid Cap Equity ETFs**\n\nDesjardins Investments has launched the Desjardins Global Macro ETF (DGLM) and the Desjardins American Mid Cap Equity Index ETF (DMID). DGLM uses long/short positions across global asset classes to target positive returns in all markets (0.90% fee), while DMID tracks the Solactive GBS United States 400 CAD Index, focusing on U.S. mid-cap equities (0.10% fee).\n\n**Dynamic Funds Launches Active U.S. Dollar Discount Bond ETF**\n\nDynamic Funds has introduced the Dynamic Active U.S. Discount Bond ETF (DXDU/U), offering unhedged exposure to U.S. dollar–denominated investment grade corporate bonds. With a 0.35% management fee, the actively managed fund aims to deliver interest income and long-term capital growth.\n\n# Canada ETF Updates\n\n**Global X Adds USD Units to Covered Call ETF Suite**\n\nGlobal X has launched USD units for the Global X Russell 2000 Covered Call ETF (RSCC/U) and the Global X Nasdaq 100 Covered Call ETF (QQCC/U). Both ETFs aim to provide index exposure with monthly income from dividends and call option premiums. Each has a 0.65% management fee and offers U.S. dollar–denominated access to their covered call strategies.\n\n# Canada ETF Filings\n\n**Rocklinc Files for First ETF with Global Equity Focus**\n\nRocklinc Investment Partners has filed for the **Rocklinc Principled Equity ETF (RKLC)**, targeting long-term total returns through a global equity portfolio. Using a value-based approach, the ETF will hold 20–30 stocks and charge a 0.80% management fee. This marks Rocklinc’s planned entry into the ETF market.\n\n*Please note this article is for information purposes only and does not in any way constitute investment advice. It is essential that you seek advice from a registered financial professional prior to making any investment decision.*",
      "author": "etfshelf",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-09-06T20:42:50.000Z",
      "permalink": "/r/ChatETF/comments/1naa9dp/etf_industry_news_sep_15_2025/",
      "ignored": false,
      "numComments": 0
    },
    {
      "id": "t3_1naa8sk",
      "type": "post",
      "subreddit": "ETFs",
      "title": "ETF Weekly Industry Updates - Sep. 1-5, 2025",
      "body": "ETF Weekly Update (September 1 - September 5, 2025): New launches, fund moves, and filings shape a steady week across U.S., Europe, and Canada.\n\n# U.S. Weekly ETF Industry News\n\n# U.S. ETF Launches\n\n**GraniteShares Launches 2x Leveraged ETFs for ETOR and BULL**\n\nGraniteShares debuts two new leveraged ETFs—[ETRL](https://www.trackinsight.com/en/fund/ETRL) and [BULX](https://www.trackinsight.com/en/fund/BULX)—offering 2x daily exposure to eToro and Webull stocks. Designed for short-term trading, these funds aim to amplify daily price moves of the underlying companies. Both ETFs are now listed on Nasdaq.\n\n**Defiance Launches 2x Leveraged ETF for Arista Networks (ANEL)**\n\nDefiance ETFs has introduced [ANEL](https://www.etfcentral.com/fund/ANEL), offering 2x daily exposure to Arista Networks (ANET). The fund uses derivatives to amplify daily performance and targets short-term traders seeking leveraged exposure without margin. Arista is known for its cloud networking and AI-driven infrastructure solutions.\n\n**Defiance Launches 2x Leveraged ETF for Philip Morris (ZYN)**\n\nDefiance ETFs has launched [ZYN](https://www.trackinsight.com/en/fund/ZYN), a fund offering 2x daily exposure to Philip Morris (PM). Using derivatives, ZYN targets short-term traders seeking amplified returns tied to PM’s stock. The company is known for its smoke-free IQOS products and push toward reduced-risk alternatives.\n\n**Defiance Debuts 2x Inverse ETF for Eli Lilly (LLYZ)**\n\nDefiance ETFs has launched [LLYZ](https://www.trackinsight.com/en/fund/LLYZ), offering -2x daily exposure to Eli Lilly (LLY). Designed for active traders, the fund uses swaps and options to amplify downside moves. It targets those seeking short-term inverse exposure without margin, but carries high risk if held beyond one day.\n\n**LionShares Launches Tax-Efficient U.S. Equity ETF (TOT)**\n\nLionShares debuts its first ETF, [TOT](https://www.trackinsight.com/en/fund/TOT), aiming to track total U.S. equity returns without paying dividends. The fund minimizes tax drag by retaining earnings, using ETFs, futures, or options for exposure. Led by ex-Jane Street trader Sofia Massie, TOT offers low fees and targets long-term, tax-conscious investors.\n\n**Grayscale Launches Ethereum Covered Call ETF (ETCO)**\n\nGrayscale has introduced [ETCO](https://www.trackinsight.com/en/fund/ETCO), an actively managed ETF aiming to generate income by writing call options on Ethereum-linked ETPs. The fund targets Ether’s volatility to deliver bi-weekly distributions, appealing to income-focused investors. ETCO joins Grayscale’s lineup of crypto-based income strategies, including BTCC and BPI.\n\n**SoFi Launches Agentic AI ETF Targeting Autonomous Tech (AGIQ)**\n\nSoFi has launched the [Agentic AI ETF (AGIQ)](https://www.trackinsight.com/en/fund/AGIQ), tracking U.S. firms advancing agentic AI—autonomous systems that make decisions and take actions. The fund follows the BITA US Agentic AI Select Index, including Tesla, NVIDIA, and Salesforce. AGIQ offers targeted exposure to the next wave of AI innovation, with a 0.69% expense ratio.\n\n# U.S. ETF Updates\n\n**LifeX Simplifies Longevity ETF Lineup into 2050–2065 Options**\n\n[LifeX ](https://www.trackinsight.com/en/etf-screener?search=lifex)will consolidate 28 Longevity Income ETFs—14 fixed and 14 inflation-protected—into streamlined funds maturing in 2050, 2055, 2060, and 2065. The reorganizations, expected to be tax-free, begin on Sept. 15. The move simplifies investor choices while preserving payout goals and target maturity structure.\n\n**Cyber Hornet ETF Changes ZZZ Ticker to BBB**\n\nCyber Hornet’s S&amp;P 500® and Bitcoin 75/25 Strategy ETF has changed its Nasdaq ticker from ZZZ to [BBB](https://www.trackinsight.com/en/fund/BBB), effective Sept. 2. The fund, which blends 75% S&amp;P 500 exposure with 25% Bitcoin futures, returned 39% in 2024, ranking in the top 2% of Morningstar’s Large-Blend category.\n\n# U.S. ETF Closures\n\n**VanEck to Liquidate Two ESG-Themed ETFs on September 26**\n\nVanEck will close and liquidate its Morningstar ESG Moat ETF (MOTE) and Wide Moat Growth ETF (MGRO) due to low investor interest and other factors. Trading ends September 19, with liquidation proceeds paid on or around September 26. Investors holding shares at liquidation will receive cash based on net asset value.\n\n# U.S. ETF Filings\n\n**Defiance Files Leveraged ETFs Targeting Single Stocks**\n\nDefiance has filed for ETFs offering 150–200% daily leveraged exposure to stocks including DigitalOcean Holdings (DOCN), Hertz Global Holdings (HTZ), Newegg Commerce (NEGG), The NFT Gaming Company (NMAX), and Rumble Inc. (RUM). The funds use swaps and options to amplify returns while managing risk.\n\n**PeakShares Files for Actively Managed Equity Allocation ETF**\n\nPeakShares has filed for an ETF investing at least 80% in stocks and equity ETFs, aiming to mirror S&amp;P 500 sector weights while actively selecting positions. The fund will hold 20–80 names and use macro and bottom-up analysis to adjust allocations based on market conditions, with flexibility across sectors and market caps.\n\n**Leverage Shares Files for 2x Capped Accelerated ETFs on Single Stocks**\n\nLeverage Shares has filed for ETFs targeting 2x monthly returns on stocks like Applovin Corporation (APP), with upside capped and full downside exposure. These structured funds use FLEX options to pursue accelerated gains. Additional filings include ETFs tracking BBAI, BLSH, BMNR, BULL, CRCL, CRWV, FIG, GEMI, HIMS, HOOD, LLY, QBTS, RGTI, and SBET.\n\n**NEOS Plans High-Income ETF with Synthetic Bitcoin Exposure**\n\nThe NEOS Boosted Bitcoin High Income ETF will target high monthly income and Bitcoin appreciation through synthetic strategies. It uses options on Bitcoin-related assets and spot Bitcoin ETPs, aiming for \\~150% notional exposure. The fund won’t hold Bitcoin directly and aspires to yield 37–45% annually (not guaranteed).\n\n**NEOS Proposes S&amp;P 500 ETF with Boosted Income Strategy**\n\nThe NEOS Boosted S&amp;P 500® High Income ETF combines S&amp;P 500 equity exposure with synthetic call and put options to boost both long exposure and income. Modeled after SPYI, it targets a 15–18% annualized distribution using covered and synthetic call strategies. The fund aims for \\~150% notional exposure and may see high portfolio turnover.\n\n**VistaShares Files for Bitcoin and Ethereum Treasury Income ETFs**\n\nVistaShares proposes ETFs offering income and long-term growth by investing in firms with significant Bitcoin or Ethereum holdings. The funds use synthetic exposure and options for yield, tracking custom indexes. Neither fund holds crypto directly and both aim to boost returns via flexible derivatives strategies.\n\n**VistaShares Proposes Ethereum-Focused ETF with Synthetic Exposure**\n\nA second Ethereum-focused ETF from VistaShares will track companies involved in the ETH ecosystem, including staking firms. The strategy includes synthetic exposure via swaps and short-dated options, plus an income layer from options premiums. Like its Bitcoin counterpart, it avoids direct crypto holdings.\n\n**VistaShares Plans IPO-Focused Income ETF**\n\nVistaShares also filed for an ETF targeting newly public U.S. firms (IPO within 24 months), combining equity exposure with income strategies. It uses synthetic replication via options and swaps and generates yield by selling options on underlying stocks. The portfolio will hold 20–50 IPO names, plus U.S. Treasuries.\n\n**Alpha Architect Files for U.S. Growth-Focused Equity ETF**\n\nAlpha Architect is launching an actively managed ETF targeting large-cap U.S. growth stocks, selected by metrics like sales growth, earnings momentum, and price performance. The fund may also use ETFs and options to broaden exposure. It allows some mid/small-cap exposure and may have frequent portfolio turnover.\n\n# U.S. ETF Issuer Milestone\n\n**iShares ETF AUM Surpasses $5 Trillion as BlackRock Eyes Product Overhaul**\n\nBlackRock’s iShares ETFs have crossed $5 trillion in global AUM, driven by surging demand for accessible, risk-managed investing. The firm is reviewing its ETF lineup, including a tech ETF revamp, and expanding in APAC. BlackRock forecasts the ETF market could grow from $15T to $27T globally within five years.\n\n**VistaShares Surpasses $500M AUM, Led by Income-Focused ETFs**  \nVistaShares has crossed $500M in assets under management, less than a year after launching. The lineup includes OMAH, which combines Buffett-style investing with a 15% income target, plus thematic ETFs like AIS and WILD. A fifth fund, ACKY, debuts September 9, as the firm continues to expand its innovative ETF offerings.\n\n# U.S. ETF Milestone\n\n**Defiance’s Quantum Computing ETF (QTUM) Surpasses $2B AUM**\n\nDefiance ETFs’ QTUM has exceeded $2B in assets, fueled by rising interest in quantum tech. Tracking the BlueStar Quantum Computing and Machine Learning Index, QTUM holds firms like D-Wave, IonQ, and Rigetti. Launched in 2018, the fund also boasts a 5-star Morningstar rating as of June 30, 2025.\n\n# U.S. ETF Ecosystem\n\n**Ondo Finance Launches Tokenized Stock Platform via Alpaca Integration**\n\nOndo Finance has launched Ondo Global Markets, offering 100+ tokenized US stocks and ETFs—expandable to 1,000+ by year-end—via integration with Alpaca. Available 24/7 and usable in DeFi, these assets are fully backed by securities held with U.S. custodians. The platform aims to expand access for investors in APAC, Africa, and Latin America.\n\n**Coinbase to Launch Mag7 + Crypto Equity Index Futures on Sept. 22**\n\nCoinbase is debuting Mag7 + Crypto Equity Index Futures, a new product blending exposure to top tech stocks and BlackRock’s Bitcoin and Ethereum ETFs. Evenly weighted across 10 assets—including Apple, Nvidia, Tesla, and Coinbase itself—the futures aim to attract traders by bridging crypto and traditional equity markets.\n\n# Europe Weekly ETF Industry News\n\n# EU ETF Launches\n\n**Global X Expands SuperDividend Lineup with UK and Europe ETFs**  \nGlobal X has launched UKSD and EUSD, tracking 25 high-yield stocks in the UK and Europe with dividend yields between 4% and 20%. Both ETFs carry a 0.45% TER and follow Solactive indexes. The launch expands Global X’s super dividend suite, joining SDIV, which targets global income equities.\n\n**Fidelity International Launches Fundamental Active ETFs in Europe**\n\nFidelity has expanded its European ETF lineup with two new active equity funds: the US Fundamental Large Cap Core UCITS ETF and the US Fundamental Small-Mid Cap UCITS ETF. Leveraging Fidelity Investments' high-conviction research, these ETFs aim for long-term growth and alpha, with listings on Xetra and more exchanges to follow.\n\n**WisdomTree Launches Quantum Computing UCITS ETF (WQTM)**\n\nWisdomTree has unveiled WQTM, a UCITS ETF offering exposure to global companies advancing quantum computing. Tracking a custom index developed with Classiq, the fund covers quantum chips, software, cryptography, and more. Listed on major European exchanges, WQTM carries a 0.50% TER and targets early access to this emerging tech frontier.\n\n**DWS Launches Cheapest MSCI World Small Cap ETF in Europe**\n\nDWS has debuted three small-cap ETFs—XSWC, XZSW, and XZSE—tracking global and European MSCI small-cap indices with ESG and low-carbon screens. XSWC’s 0.25% TER makes it Europe’s lowest-cost MSCI World Small Cap ETF, undercutting rivals from iShares and SPDR. The launch aligns with rising demand for global diversification amid U.S. small-cap outflows.\n\n# EU Planned ETF Launches\n\n**ODDO BHF Enters ETF Market with Active Equity and Multi-Asset Trio**\n\nODDO BHF is launching its first ETFs in Europe via HANetf’s ICAV, including global equity, US equity, and global balanced allocation strategies. The actively managed funds mark a shift from its traditional mutual fund offerings, targeting high-conviction and multi-asset approaches amid growing demand for differentiated active ETFs.\n\n# EU ETF Ecosystem\n\n**Bitget and Bidget Wallet Enable Onchain Trading of Tokenised Stocks and ETFs**\n\nBitget and Bidget Wallet now offer live trading of over 100 tokenised real-world assets, including stocks and ETFs, via integration with Ondo Finance. Users outside the U.S. can invest onchain from just $1, with tokens reflecting total returns and backed by regulated custodians—marking a step toward decentralized, borderless finance.\n\n# Canada Weekly ETF Industry News\n\n# Canada ETF Launches\n\n**Global X Canada Launches 3X Leveraged and Inverse ETFs Using ICE Indices**\n\nGlobal X has introduced four BetaPro ETFs offering ±300% daily exposure to U.S. Treasuries and semiconductor stocks. Based on ICE indices, the funds include TTLT, STLT, SOXL, and SOXS. All ETFs feature currency hedging for Canadian investors seeking leveraged or inverse trading strategies.\n\n**Hamilton ETFs Launches USD Unhedged Units for SMAX and QMAX**\n\nHamilton ETFs has introduced US$ unhedged units for its SMAX and QMAX YIELD MAXIMIZER™ ETFs, now trading as SMAX.U and QMAX.U on the TSX. The new units provide U.S. dollar exposure to high-income strategies focused on large-cap U.S. equities and tech stocks, expanding currency options for investors.\n\n**Desjardins Launches Global Macro and American Mid Cap Equity ETFs**\n\nDesjardins Investments has launched the Desjardins Global Macro ETF (DGLM) and the Desjardins American Mid Cap Equity Index ETF (DMID). DGLM uses long/short positions across global asset classes to target positive returns in all markets (0.90% fee), while DMID tracks the Solactive GBS United States 400 CAD Index, focusing on U.S. mid-cap equities (0.10% fee).\n\n**Dynamic Funds Launches Active U.S. Dollar Discount Bond ETF**\n\nDynamic Funds has introduced the Dynamic Active U.S. Discount Bond ETF (DXDU/U), offering unhedged exposure to U.S. dollar–denominated investment grade corporate bonds. With a 0.35% management fee, the actively managed fund aims to deliver interest income and long-term capital growth.\n\n# Canada ETF Updates\n\n**Global X Adds USD Units to Covered Call ETF Suite**\n\nGlobal X has launched USD units for the Global X Russell 2000 Covered Call ETF (RSCC/U) and the Global X Nasdaq 100 Covered Call ETF (QQCC/U). Both ETFs aim to provide index exposure with monthly income from dividends and call option premiums. Each has a 0.65% management fee and offers U.S. dollar–denominated access to their covered call strategies.\n\nCanada ETF Filings\n\n**Rocklinc Files for First ETF with Global Equity Focus**\n\nRocklinc Investment Partners has filed for the **Rocklinc Principled Equity ETF (RKLC)**, targeting long-term total returns through a global equity portfolio. Using a value-based approach, the ETF will hold 20–30 stocks and charge a 0.80% management fee. This marks Rocklinc’s planned entry into the ETF market.\n\n",
      "author": "etfshelf",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-09-06T20:42:09.000Z",
      "permalink": "/r/ETFs/comments/1naa8sk/etf_weekly_industry_updates_sep_15_2025/",
      "ignored": false,
      "numComments": 2
    },
    {
      "id": "t3_1n9qltb",
      "type": "post",
      "subreddit": "u_Chance-Leader-2852",
      "title": "Special hot wheels",
      "body": "What do you all think?",
      "author": "Chance-Leader-2852",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-09-06T04:41:55.000Z",
      "permalink": "/r/u_Chance-Leader-2852/comments/1n9qltb/special_hot_wheels/",
      "ignored": false,
      "numComments": 0
    },
    {
      "id": "t3_1mzptyu",
      "type": "post",
      "subreddit": "comicbookcollecting",
      "title": "Mark Bagley",
      "body": "Mark Bagley did a signing at an LCS on Saturday. I only brought 3 books but I’m happy.",
      "author": "EagleJoe",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-08-25T13:00:31.000Z",
      "permalink": "/r/comicbookcollecting/comments/1mzptyu/mark_bagley/",
      "ignored": false,
      "numComments": 5
    },
    {
      "id": "t3_1msc49d",
      "type": "post",
      "subreddit": "HealthInsurance",
      "title": "New York health insurance help",
      "body": "I was a student, and was out in NYS Health Insurance through the market place. It auto renewed for 5 years. I am no longer eligible, and not even for a tax credit. I may need to pay between $600-$800 a month for the most simple / terrible (I hear) insurance, Healthfirst. \n\nHas anybody else had a situation like this? If so, how did you handle it? Luckily I am considered a small business and I can write off my healthcare premiums. But still $700 a month is a burden. For something that I barely use. I would love some feedback and suggestions! LIFEX contacted me but I read on this thread that they're a scam. ",
      "author": "CodCheap9332",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-08-17T00:00:17.000Z",
      "permalink": "/r/HealthInsurance/comments/1msc49d/new_york_health_insurance_help/",
      "ignored": false,
      "numComments": 10
    },
    {
      "id": "t3_1mo3a8c",
      "type": "post",
      "subreddit": "DeoVR",
      "title": "Monetization Rejection Reason?",
      "body": "Hello moderators,\n\nMy channel is [https://deovr.com/channel/lifex-vr-stories](https://deovr.com/channel/lifex-vr-stories)  \nFollowing is the screenshot from my channel dashboard, please let me know the reason for monetization rejection:\n\nhttps://preview.redd.it/qd4spu9bwjif1.png?width=1631&amp;format=png&amp;auto=webp&amp;s=dfc9c036199e164af8cd133bac02efafbcc9ed02\n\n",
      "author": "Broad-County8560",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-08-12T08:39:47.000Z",
      "permalink": "/r/DeoVR/comments/1mo3a8c/monetization_rejection_reason/",
      "ignored": false,
      "numComments": 2
    },
    {
      "id": "t3_1m92qug",
      "type": "post",
      "subreddit": "xToolOfficial",
      "title": "xTool On the Road: Upcoming Events &amp; Demos (Aug–Sept)",
      "body": "Hey xToolers — just wanted to share xTool's upcoming event schedule in case anyone's planning to attend these shows or is nearby. We're doing live demos, hands-on testing, and offering a few show-only perks too.  \nHere’s where xTool will be this August &amp; September:  \nUSA  \nAug 12–14 — Ace Fall Convention  \n📍 Booth 3079, McCormick Place South Building  \nAug 13–15 — Superzoo  \n📍 Booth 11059, Mandalay Bay Convention Center  \nAug 21–23 — Graphics Pro Expo  \n📍 Booth 221, Long Beach  \nAug 28–30 — The Next Level Laser Conference  \n📍 Booth 510, Gaylord Texan Resort &amp; Convention Center  \nSept 8–11 — Fabtech  \n📍 Booth B21098, McCormick Place  \nJAPAN  \nSept 3–5 — Tokyo International Gift Show LIFExDESIGN  \n📍 Booth W1 - T11-19, Tokyo Big Sight  \nIf you're attending any of these, come by and say hi! We’ll have machines running, new samples, and team members on-site to chat about builds, materials, and workflows.  \n\n\nhttps://preview.redd.it/f0blzxnlkyef1.jpg?width=2160&amp;format=pjpg&amp;auto=webp&amp;s=f33ab3183061fb189331dc60fd3596f4f1aad5e1",
      "author": "AimeexTool",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-07-25T15:48:40.000Z",
      "permalink": "/r/xToolOfficial/comments/1m92qug/xtool_on_the_road_upcoming_events_demos_augsept/",
      "ignored": false,
      "numComments": 2
    },
    {
      "id": "t3_1m7p6vp",
      "type": "post",
      "subreddit": "HumanTorchMains",
      "title": "One of my better torch games even though I lost.",
      "body": "If someone could review it and tell me what I coulda done. But mainly, I’m proud of this game. So I’m just posting it here cause I’m happy.",
      "author": "Keynanser",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-07-23T23:49:52.000Z",
      "permalink": "/r/HumanTorchMains/comments/1m7p6vp/one_of_my_better_torch_games_even_though_i_lost/",
      "ignored": false,
      "numComments": 0
    },
    {
      "id": "t3_1m2zgct",
      "type": "post",
      "subreddit": "edgar_news",
      "title": "Porter White Investment Advisors, Inc.",
      "body": "# Top Holdings by value as of 2025-06-30:\n1. DIMENSIONAL ETF TRUST - $187.7M (87%)\n2. AMERICAN CENTY ETF TR - $20.0M (9%)\n3. VANGUARD WORLD FD - $5.1M (2%)\n4. STONE RIDGE TR - $1.2M (1%)\n5. VANGUARD INDEX FDS - $795,111 (0%)\n\n\n# When compared to holdings as of 2025-03-31:\n\nNew Positions:\n* AMERICAN CENTY ETF TR - AVANTIS EMGMKT\n* STONE RIDGE TR - LIFEX 2054 INFLA\n* STONE RIDGE TR - LIFEX 2061 INFLA\n\nNo Closed Positions\n\nIncrease Position by 25% or more:\n* DIMENSIONAL ETF TRUST - GLOBAL CR ETF\n* DIMENSIONAL ETF TRUST - NATL MUN BD ETF\n\nNo Reduce Position by 25% or more\n\n*Porter White Investment Advisors, Inc. is headquartered in Birmingham, AL.*\n\n[Source](https://www.sec.gov/Archives/edgar/data/0001612457/000117266125002636/xslForm13F_X02/infotable.xml)",
      "author": "edgar_news_01",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-07-18T11:09:18.000Z",
      "permalink": "/r/edgar_news/comments/1m2zgct/porter_white_investment_advisors_inc/",
      "ignored": false,
      "numComments": 0
    },
    {
      "id": "t3_1m2ta2k",
      "type": "post",
      "subreddit": "InsuranceAgent",
      "title": "Population Science Management, GIGCare, Iron Health and Lifex plans",
      "body": "I have been looking into possibly selling the GIGCare and Lifex Plans as well as other plans from Iron Health. My issue is that these plans do not seem to be covered under most E&amp;O policies. Has anyone else researched what type of E&amp;O coverage actually works with these plans?\n\nI have only been able to find a couple of carriers that allow ERISA self funded group plans but each of these specifically state that if the group plans do not provide an annual **refund of unused claim funds** back to the employer than they are considered an exclusion and are not covered. GIGCare, LifeX and Iron Health products do not provide this refund.\n\nIf that is the case, how and where would someone find an E&amp;O policy that covers them with these products? Has anyone else looked into this? If so, who has set up an E&amp;O policy that actually provides this coverage?",
      "author": "Key_Technician_646",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-07-18T04:48:24.000Z",
      "permalink": "/r/InsuranceAgent/comments/1m2ta2k/population_science_management_gigcare_iron_health/",
      "ignored": false,
      "numComments": 3
    },
    {
      "id": "t3_1lrj8m4",
      "type": "post",
      "subreddit": "HealthInsurance",
      "title": "LifeX is being sued by Elevance Health, Anthem Insurance and Blue Cross and Blue Shield Association",
      "body": "The companies allege that LifeX \n\n&gt; As part of a scheme to\ninduce consumers to purchase health insurance through an alleged employee\nbenefit plan, LifeX has willfully and improperly used AIC’s ANTHEM mark and\nBCBSA’s BLUECARD®, BLUE CROSS® and BLUE SHIELD® word marks\nand logos (the “BCBS Marks”) in blatant violation of Plaintiffs’ trademark rights.\nCase 1:25-cv-03590-WMR Document 1 Filed 06/27/25 Page 1 of 42\n2\nSpecifically, LifeX affixed Plaintiffs’ trademarks to counterfeit health insurance\ncards and marketing materials, falsely representing itself as an authorized client\nand group policy holder of Anthem Blue Cross and Blue Shield (“Anthem BCBS”)\nhealth insurance – without Plaintiffs’ knowledge, authorization or consent.\nDefendants’ misuse of Plaintiffs’ trademarks is a deliberate fraud on consumers.\nLifeX does not maintain any employee benefit plan with Anthem and is not\naffiliated with Plaintiffs in any way. By misrepresenting this relationship,\nDefendants are deceiving unsuspecting purchasers of health insurance and health\ncare providers alike, placing the public at significant risk. Consumers purchasing\nthis so-called benefits plan from LifeX will not receive the health insurance\n\n\ncoverage that they believed they purchased because LifeX has no actual\nrelationship with Plaintiffs and no authority to offer benefits under or related to an\nAnthem BCBS plan. Indeed, LifeX is willfully selling consumers an employee\nbenefits health insurance plan that does not exist. \n\nI've never posted here before, I stumbles on this case when reading the latest Courtwatch newsletter and saw they referred to [this post](https://www.reddit.com/r/HealthInsurance/comments/1jpop3e/lifex_research_coreanthem_ppo/) and figured people here should be made aware of the lawsuit.",
      "author": "rx915",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-07-04T13:50:33.000Z",
      "permalink": "/r/HealthInsurance/comments/1lrj8m4/lifex_is_being_sued_by_elevance_health_anthem/",
      "ignored": false,
      "numComments": 21
    },
    {
      "id": "t3_1lmw1pv",
      "type": "post",
      "subreddit": "skyrizi",
      "title": "Desperately seeking option to pay for skyrizi",
      "body": "Long story short, my business partners, and I signed up for Lifex health insurance, and the only script that had to be covered was skyrizi for one of my business partners-it was in the formulary and the agent said it would be covered but since it’s a specialty medication, they just referred us to patient assistance. I feel terrible and they’re all angry at me because I had referred them to the agent as I’m in the insurance business myself and thought he was the most knowledgeable person for the job.  They are attorneys and make a lot of money so I don’t think they would qualify for anything needs based. I’m making myself crazy and haven’t slept and almost 3 days trying to find some kind of option. Talk to Skyrizi and even the Copay Assisstance card would require them to have a higher level of coverage through the insurance ",
      "author": "Nicolacrayola",
      "score": 10,
      "label": "negative",
      "confidence": 0.7,
      "createdUtc": "2025-06-28T20:06:07.000Z",
      "permalink": "/r/skyrizi/comments/1lmw1pv/desperately_seeking_option_to_pay_for_skyrizi/",
      "ignored": false,
      "numComments": 9
    },
    {
      "id": "t3_1lek5my",
      "type": "post",
      "subreddit": "Hardcore",
      "title": "Any Louisville Hardcore/Punk Forum Veterans On Here?",
      "body": "This may be a long shot but I figured here was as good a place to ask this as any. Back when I was a youth in Louisville, KY there was an old-school online forum for the local punk/hardcore/metal scene. I recall members of Brother Doubt, Coliseum, Xerxes, xHardLifex, Kinghorse, and a bunch of other 2000s Louisville acts were active on there. It was the usual sort of forum fare of its time, a mixture of people talking about their lives with show announcements and dumb arguments over music and scene drama, great stuff for a dumb kid as I was. It was up and active through 2012 but went down in 2013 as Facebook became more of an online scene meeting place. The history section of the site is still up and active though, you can visit it [here.](https://history.louisvillehardcore.com/)\n\nAny other 502 oldsters on here and remember what I'm talking about? My handle at the time was \"Anghrist\".",
      "author": "Iobliquus",
      "score": 90,
      "label": "positive",
      "confidence": 0.7,
      "createdUtc": "2025-06-18T15:32:56.000Z",
      "permalink": "/r/Hardcore/comments/1lek5my/any_louisville_hardcorepunk_forum_veterans_on_here/",
      "ignored": false,
      "numComments": 9
    },
    {
      "id": "t3_1lax5qi",
      "type": "post",
      "subreddit": "investimentos",
      "title": "Investindo no Exterior",
      "body": "https://preview.redd.it/5vkj97jits6f1.png?width=750&amp;format=png&amp;auto=webp&amp;s=7efb5e8cddbdccca61c60ff20d6bdc4cce800efc\n\nGalera, eu estou na webull pois comecei com meus investimentos no exterior, e queria saber qual seria o equivalente ao renda fixa la pra bolsa de fora. Por exemplo, eu uso a webull, e queria saber o equivalente. Me falem mais sobre esses investimentos mais seguros, tambem poderia citar o tesouro direto e por ai vai. Me ajudem por favor",
      "author": "Janna_Ap77",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-06-14T01:52:03.000Z",
      "permalink": "/r/investimentos/comments/1lax5qi/investindo_no_exterior/",
      "ignored": false,
      "numComments": 2
    },
    {
      "id": "t3_1l7um6y",
      "type": "post",
      "subreddit": "UFOB_Disclosures",
      "title": "u/toxictoy unbanned a user from r/UFOB",
      "body": "### On 10/6/2025, at approximately 09:45, u/toxictoy unbanned a user from r/UFOB\n\n##### Permalink\n\n&gt; https://reddit.com/user/xXxAfterLifexXx\n\n---\n\n^(This content was automatically generated, and correct at the time of posting. Changes to the referenced content, such as edits or deletions, may not be reflected here. All times are in UTC.)",
      "author": "open-mod",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-06-10T09:47:20.000Z",
      "permalink": "/r/UFOB_Disclosures/comments/1l7um6y/utoxictoy_unbanned_a_user_from_rufob/",
      "ignored": false,
      "numComments": 0
    },
    {
      "id": "t3_1l48j7f",
      "type": "post",
      "subreddit": "BreakUps",
      "title": "Couldnt even breath properly without her",
      "body": "So me and my love of my life, for 1.4 years, first gf first crush everything first, and she left me I can't process itt\nYes there were mistakes by me and by her\nI feel all the shit I did was because she broke my trust in the first place (not actually cheating but something close by and I was hurt alot, I couldn't even breath propely when I first found that out) , then I always wanted to push her out of my lifex though she kept holding even though I kept pushing\nIt's not like I never showed her love, in fact she also clearly knew I can die forherH DIE\nAnd then she gave up after alot of pushing\n\nWell I pushed her\nAnd actually idk man, is it my fault for pushing or her fault for keep repeatung a few things I told her not to do \n\nI'm fucked icant process anything it's been 3 months\nIdk what to do now, yes I hated her becasue of doing somehting I wouldn't ever expect her to do  I also loved her alot \nAnd now that it has happened what I wanted\nI can't process it\nI can live now\nIt's fuckinf difficult to even smile\nWhenever I smile immidietly her thought hits in\n\nOH GODDDD IT'S LIKEAO PHYSICAL PAIN IN THE CHEST\n\nI CAN'T FUCKING PROCESS THIS \nI WANT Freedom from her thoughts either by forgetingshee ever came in life and I mean it literally, literally forgeting her that she ever was my gf. Or either her coming back\nI don't see any other way\nIk time heals\nBut I'm likeaa physopath\nIdk what to do with my brain\nI newd.....i wanna sleep peacefillt for once forgod sake\n\nAND SHE IS CARELESSSSSS \nAND MOVED ON LIKE SO FUCKING QUICK IDK HOW\nSHE SEEMED HELLA MORE SERIOUS WHEN WE WERE TOGETEHER LIKE SHE MIGHT DIE OF A HEART ATTACK IF WE EVER BROEK UP\n\n\nAND NOW SHE'S FUCKING HAPPY WITHOUT ME \nLIVING SMILING WITHOUT ME WHILE I'M LITERALLY DYING FOR HER\n\n\nPLEASE can anyone relate??? 😮‍💨😞",
      "author": "depressed-aff",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-06-05T19:41:01.000Z",
      "permalink": "/r/BreakUps/comments/1l48j7f/couldnt_even_breath_properly_without_her/",
      "ignored": false,
      "numComments": 2
    },
    {
      "id": "t3_1l3sq93",
      "type": "post",
      "subreddit": "Silksong",
      "title": "Remember when Xbox randomly hinted at Silksong back in March? We all forgot about this after April 2 but in hindsight I think this heavily indicates news at the Xbox Showcase on June 8th.",
      "body": "",
      "author": "Exact-Advertising630",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-06-05T07:01:25.000Z",
      "permalink": "/r/Silksong/comments/1l3sq93/remember_when_xbox_randomly_hinted_at_silksong/",
      "ignored": false,
      "numComments": 10
    },
    {
      "id": "t3_1l2sfol",
      "type": "post",
      "subreddit": "Jackery",
      "title": "(Jackery 1000 Plus Test) Refrigerator, TV, CPAP and two Lights",
      "body": "For those of you that have smaller units like me here are some Test Numbers. This is with the 1000 Plus and two Expansion Battery Packs.\n\nFirst Photo shows an Air Sense 11 CPAP with Heat on. (35 Watts / 20 hrs) with just the 1000 Plus with no Battery Packs connected. \n\nSecond Photo Whirlpool Side by Side Fridge/Freezer and two LifeX Light Bulbs using (150 Watts / 20 hrs) this time with both Battery Packs Connected. \n\nThird Photo Whirlpool Side by Side Fridge/Freezer and two LifeX Light Bulbs, 65 inch LG C1 TV, Apple TV 4k and CPAP all running at same time.\n(226 Watts / 14.4 hours)\n \nFourth Photo what Stacked and Packed looks like. 😂\n\nNote that when the Whirlpool Fridge was first turned on with compressor running it was using 630 watts just for the Whirlpool then turned off and it went down to 107 watts without compressor running. \n",
      "author": "Paul_Deemer",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-06-04T00:50:15.000Z",
      "permalink": "/r/Jackery/comments/1l2sfol/jackery_1000_plus_test_refrigerator_tv_cpap_and/",
      "ignored": false,
      "numComments": 7
    },
    {
      "id": "t3_1kyel7s",
      "type": "post",
      "subreddit": "KaynMains",
      "title": "Coming back to kayn, I feel useless",
      "body": "Haven't played Kayn in a hot second until recently and god I feel useless, is eclipse just fucking dead? Is voltaic the go-to for rhaast now?\n\nWith blue it's worse, because I do well, get mildly fed, blow someone up and then I receive no followup from my team on teamfights or they die too quickly before anything \n\nAside from *dying less and farming more* could someone tell me what I could improve and how much kayn's build has changed? It would be very very useful ",
      "author": "SaaveGer",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-05-29T16:03:58.000Z",
      "permalink": "/r/KaynMains/comments/1kyel7s/coming_back_to_kayn_i_feel_useless/",
      "ignored": false,
      "numComments": 6
    },
    {
      "id": "t3_1kwj7i5",
      "type": "post",
      "subreddit": "UFOB_Disclosures",
      "title": "u/toxictoy banned a user from r/UFOB",
      "body": "### On 27/5/2025, at approximately 09:45, u/toxictoy banned a user from r/UFOB\n\n##### Permalink\n\n&gt; https://reddit.com/user/xXxAfterLifexXx\n\n---\n\n^(This content was automatically generated, and correct at the time of posting. Changes to the referenced content, such as edits or deletions, may not be reflected here. All times are in UTC.)",
      "author": "open-mod",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-05-27T09:46:21.000Z",
      "permalink": "/r/UFOB_Disclosures/comments/1kwj7i5/utoxictoy_banned_a_user_from_rufob/",
      "ignored": false,
      "numComments": 0
    },
    {
      "id": "t3_1ksbmxj",
      "type": "post",
      "subreddit": "HealthInsurance",
      "title": "LifeX Anthem/PHCS PPO",
      "body": "Has anyone had any experience with these plans? It looks like a group plan that covers way more benefits than what these other private plans are offering.",
      "author": "mcvey15",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-05-21T22:54:12.000Z",
      "permalink": "/r/HealthInsurance/comments/1ksbmxj/lifex_anthemphcs_ppo/",
      "ignored": false,
      "numComments": 9
    },
    {
      "id": "t3_1ko08ms",
      "type": "post",
      "subreddit": "HelloSweetDaysEn",
      "title": "DLF SC SSR TEARS + lips + hair",
      "body": "hi! im dlf the new sc ssr tears and lips! im also looking for the hair for a bestie :) these are my most notable dupes",
      "author": "dykezai",
      "score": 80,
      "label": "positive",
      "confidence": 0.7,
      "createdUtc": "2025-05-16T12:59:59.000Z",
      "permalink": "/r/HelloSweetDaysEn/comments/1ko08ms/dlf_sc_ssr_tears_lips_hair/",
      "ignored": false,
      "numComments": 0
    },
    {
      "id": "t3_1kljpgr",
      "type": "post",
      "subreddit": "askberliners",
      "title": "Moving to Berlin – Anyone here lived in LifeX?",
      "body": "I’m moving to Berlin soon and considering staying at LifeX for the first few months. I haven’t been able to find many detailed reviews online, so I’d really appreciate it if anyone could share their experience.. like the good, the bad, or anything I should watch out for. Thanks !!",
      "author": "Gloomy_Clue_236",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-05-13T11:39:43.000Z",
      "permalink": "/r/askberliners/comments/1kljpgr/moving_to_berlin_anyone_here_lived_in_lifex/",
      "ignored": false,
      "numComments": 8
    },
    {
      "id": "t3_1kj951v",
      "type": "post",
      "subreddit": "askberliners",
      "title": "Any Experiences Living at LifeX Berlin?",
      "body": "Hey so Im going to move to Berlin soon and is thinking of staying in LifeX. I cant find much reviews so I'd love to hear people's experiences. ",
      "author": "Feisty-Ocelot3727",
      "score": 80,
      "label": "positive",
      "confidence": 0.7,
      "createdUtc": "2025-05-10T12:29:15.000Z",
      "permalink": "/r/askberliners/comments/1kj951v/any_experiences_living_at_lifex_berlin/",
      "ignored": false,
      "numComments": 2
    },
    {
      "id": "t3_1jpop3e",
      "type": "post",
      "subreddit": "HealthInsurance",
      "title": "LifeX research core/Anthem PPO",
      "body": "An insurance agent is trying to sell me on a plan that includes joining the lifeX research corp as an employee to just fill out surveys… And the coverage for medical insurance is through anthem PPO. Coverage is around $500 a month with $1000 deductible, and it's only a $250 co-pay to give birth. It seems too good to be true… And I can't find any information online, does anyone have any experience with this company?",
      "author": "Coffee-lover_2660",
      "score": 80,
      "label": "positive",
      "confidence": 0.7,
      "createdUtc": "2025-04-02T13:35:19.000Z",
      "permalink": "/r/HealthInsurance/comments/1jpop3e/lifex_research_coreanthem_ppo/",
      "ignored": false,
      "numComments": 146
    },
    {
      "id": "t3_1jefsek",
      "type": "post",
      "subreddit": "HealthInsurance",
      "title": "Scam?",
      "body": "This is a little too late kind of question. \n\nBasically, I am switching jobs and will need to buy my own insurance. I’m planning on getting pregnant and in my state, I do not have any marketplace plans that will cover maternity related things. I went through an agent and was told me that I can get a private plan and it’d be a Cigna PPO network. Everything sounded decent until I got the paperwork for it and it kept talking about lifeX and kmg. I called him and he said that the plan is through KMG by being a minority employer of lifeX research coperation. Apparently, this is a totally legit thing to do per the broker/agent. \n\nHave anyone ever heard of this? Is this really legit? \n\nUnfortunately I already gave out all mine and family info before I knew about the whole lifeX and kmg thing. I thought I was just signing up for Cigna PPO but apparently KMG owns the plan and uses Cigna’s network. \n\nUgh idk what to do. \n\nThoughts? Advice? ",
      "author": "Dull-Win-7296",
      "score": 50,
      "label": "neutral",
      "confidence": 0.5,
      "createdUtc": "2025-03-18T20:59:51.000Z",
      "permalink": "/r/HealthInsurance/comments/1jefsek/scam/",
      "ignored": false,
      "numComments": 18
    },
    {
      "id": "t3_1efh3gu",
      "type": "post",
      "subreddit": "ClerithKingdom",
      "title": "「Light and Darkness」from r/clerith",
      "body": "Album from [Light and Darkness : ](https://www.reddit.com/r/clerith/comments/1eenspw/light_and_darkness/)\n\n&gt;P2: 戦いのあと人知れず姿を隠し、1人で静かに暮らしていたクラウド。(promo from DGPS vol. 227)\n\n&gt;-After the battle, Cloud had been hiding in plain sight, living a quiet life by himself.\n\n&gt;\n\n&gt;P3: クラウドの心の中にはまだエアリスがいて、ティファもそれを理解している･･････。(Ibid.)\n\n&gt;-Aerith is still in Cloud's heart, and Tifa understands that...\n\n&gt;\n\n&gt;P4: セフィロスを打ち倒したあと、誰とも接しず1人でひっそりと暮らしていたが･･････。(promo around Jul. 2004?)\n\n&gt;-After defeating Sephiroth, he lived quietly by himself, not interacting with anyone...\n\n&gt;\n\n&gt;P5. ティファは今、ミッドガル七番街の酒場「セブンスヘヴン」を1人で切り盛りしていた。「元気にしてるの?」という言葉から、2人がしばらく会っていないと推察できる。(promo from The Playstation2 Jul. 23rd, 2004)\n\n&gt;-Tifa is currently running the bar \"Seventh Heaven\" by herself. From the words \"Are you doing well?\"(元気にしてるの?), it can be inferred that these two have not seen each other for a long time.\n\nWell, why these magazine editors got this kind of messages from SQ promo department, in my guess, instead of willing to make us Clerith happy, it was most likely a psy-op to make people feel sorry for T's situation.\n\nIn the timespan between **NMR\"broke up** the scenario\" and **the retcon** OtWtaS happened, they had to find an excuse for T's screentime in current AC, which was very little to zero in the original 20min script.\n\n**P6:** Originally, FF7-AC (or FF7-Reunion, as FF7-AC-RF, p73 said: \"サブタイトルは当初 「リユニオン」だった?\"=\"Original subtitle: Reunion?\") was a 20 minute long script, and had nothing to do with Tifa.\n\n[From the EGM page in my old \"Nomura's drama\" post,](https://www.reddit.com/r/0/comments/1d0bsr2) his own words:\n\n&gt;Tetsuya Nomura: It's funny, I didn't originally approach Advent Children from an action standpoint: It was all about the dramatic aspects of the story. The script came first and offered no real direction for the fight scenes. And I couldn't very well assault the viewers with nonstop scenes of gripping drama; it would simply be too tiring for the viewers. **So I broke up the scenario,** inserting action sequences throughout the film in a vaguely abstract way. Back to your question about my inspirations for the fight scenes. Well, I think the unique look might just be a result of a bunch of game creators coming together to make a film...games are **violent**, and we're used to creating **violence**. I can't really point out any single works that influenced the creation of AC. Everything in my life inspires me.\n\nT was inserted into the scenario for action/**violence** purpose, just like other things NMR inserted into it, maybe plus his waifuism.\n\nEither willing to make her existence more reasonable to the majority of FF7 players, or NMR and they secretly knew she had taken away what should not belong to her,\n\nthey tried to make her kinda a \"victim\": an abandoned woman, a \"single mother\"(sort of) .etc, just like the \"I'm the victim myself\" mental defense of every perpetrator.\n\n&gt;Original text of NMR's words in P6 upper 6 panels:\n\n&gt;[https://www.youtube.com/watch?v=nsfnbHQAZY0&amp;t=175](https://www.youtube.com/watch?v=nsfnbHQAZY0&amp;t=175)\n\n&gt;野島さんの20分のシナリオがあってですね, = panel 1\n\n&gt;(で、自分はその話はけっこうすごい好きな) = some diplomatic language, claims he \"loves that original 20min script so much\".\n\n&gt;話でクラウドに対して女性からメッセージが届くと = panel 2\n\n&gt;ただそのメッセージはその子供、 = panel 3\n\n&gt;いろんな子供を通じてクラウドに伝えられていくっていうような物語 = panel 4\n\n&gt;で、最後は = panel 5\n\n&gt;そのメッセージを伝えている人が誰なのかっていうのが分かって終わるっていう = panel 6\n\n**P7:** You can feel NMR's strong willing of \"adding\" his s\\_\\_t into AC scenario, which almost sounds like harassment and threatening to me:\n\n&gt;----―番最初にあった、20分程度の尺を想定したぐらいの脚本からは実に5倍近い長さになりましたが、テーマ、ストーリーとも当初とは全然違うものに?\n\n&gt;----The script was originally intended to be about 20 minutes long, but now it's nearly five times as long. Are the theme and story completely different from the original?\n\n&gt;&gt;野島: いえ、テーマはずっと同じです。\n\n&gt;&gt;Nojima: No, the theme is always the same.\n\n&gt;----テーマは同じだけれど、当初からするとかなり変わっていると。\n\n&gt;---- that the theme is the same, but it has changed a lot since the beginning.\n\n&gt;&gt;野島:最終的なものだけを観るさんには比較できないと思いますが、個人的にはとても変わりました。追加などに関する電話が午前、朝方にかかってきたりとか(笑)。\n\n&gt;&gt;Nojima: I don't think you can compare the final product, but in my personal opinion, it has changed a lot. \\[\\]I have received phone calls in the morning and early afternoon regarding additions, etc.\\[\\] (laughs).\n\n&gt;----それは野村さんから?\n\n&gt;---- Is that from Mr. Nomura?\n\n&gt;&gt;野島:そうです。口調は柔らかいんですけど、その柔らかさが逆に怖かったです。\n\n&gt;&gt;Nojima: Yes, that's right. \\[\\]His tone of voice was soft, but that softness scared me.\\[\\]\n\n&gt;----(笑)。ではそうした野村さんなりのアイデアを受けて「じゃあこのシーンを入れるんなら、もうちょっとこういうところも欲しいですね」というやりとりがあったと。\n\n&gt;----(laugh). So, you took Nomura's ideas and said, \"Well, if you're going to include this scene, I'd like to see a little more of this in it.\n\n&gt;&gt;野島:そうです。シナリオの整合性というか、気持ちよくそのシーンに入っていけるように色々と変えてますね。\n\n&gt;&gt;Nojima: Yes, that's right. I changed the scenario in various ways to make it more consistent, or to make it easier for the audience to enter the scene.\n\n**P8:** Novella OtWtaS is a retcon, not where the movie scripts came from.\n\n[Novella OtWtaS is a retcon, not where the movie scripts came from](https://preview.redd.it/y26xe8jm7kfd1.png?width=2296&amp;format=png&amp;auto=webp&amp;s=762085e0a4c39329fd27ecc59f38aeb601b241c3)\n\nFor example in Denzel case:\n\n&gt;ACで得られる情報としては、孤児だということと、星痕症候群で苦しんでいるということだけですから、そこに至るまでの話にすればいいな、と。なぜ孤児になったのか?そこから考えましたから、悲しい物語になるのは、デンゼルには悪いけれど、仕方がないなあ、と。\n\n&gt;The only information we get in AC is that he's an orphan and that he suffers from geostigma, so I wanted the story to lead up to that. Why was he orphaned? I thought about it from there, so it would be a sad story, which is bad for Denzel, but I couldn't help it.\n\nDenzel probably was designed as a simple plot device to make T looks like a \"single mother\". As for T's retcon, NJM's own words:\n\n&gt;「ティファ編」は･･････そもそも、ティファとクラウドはうまく行かないんじゃないかという前提がありまして、これは星痕やらセフィロスが無くても同じではないか、と。僕の恋愛観とか結婚観、家族観について語るつもりはありませんが(笑)。ACCの後、デンゼルとマリンがなんとかしてくれればいいんですけど。エアリスとだったらうまく行ったかもしれませんが、エアリスの負担が大きいだろうなとも思います。ああ、思い出しました。ティファを通じてクラウドという人を書きたかったというのがありました。ただやっぱり彼はなかなか本心を見せてくれませんね(笑)。\n\n&gt;The \"Tifa chapter\" is based on the premise that Tifa and Cloud wouldn't get along in the first place, and **this would be the same without the geostigma and Sephiroth.** I'm not going to talk about my views on love, marriage and family lol, but after ACC, I hope Denzel and Marin can manage it. If it had been with Aerith, it might have worked out, but I also think it would have been too much of a burden for Aerith.\\[1\\] Oh, I remember. I wanted to write a person called Cloud through Tifa. But after all, he doesn't show his true feelings very often lol.  \n=  \n\\[1\\] alternative transl: Things might work out with Aerith, but I think it would be a heavy burden for her.\n\nMy point is, at least before all the retcon, \"They had a happy life before Cloud got geostigma\" is impossible. T in AC world is MEANT to be miserable, in order to gain some sympathy, as they designed.\n\n=\n\nIn OG, all the \"meaningful parts\" of T's story were outsourced to a newcomer Masato Kato:\n\n&gt;From wiki: [ja.wikipedia.org/wiki/加藤正人\\_(ゲームクリエイター)](http://ja.wikipedia.org/wiki/加藤正人_(ゲームクリエイター))\n\n&gt;ファイナルファンタジーVII（1997年）（PlayStation）: 企画・演出（ヘルプとしての飛び入り参加）\n\n&gt;FF7: planner, script writer (Jumping in as help).\n\n&gt;\n\n&gt;His own words:\n\n&gt;[https://web.archive.org/web/20190708015558/http://www.procyon-studio.com/special/mf\\_kato.html](https://web.archive.org/web/20190708015558/http://www.procyon-studio.com/special/mf_kato.html)\n\n&gt;English: [https://web.archive.org/web/20141110015653/http://mitsuda.cocoebiz.com/friends/kato.html](https://web.archive.org/web/20141110015653/http://mitsuda.cocoebiz.com/friends/kato.html)\n\n&gt;\n\n&gt;PS FF7(ヘルプで急遽手伝わされて、企画、演出)\n\n&gt;PlayStation: Final Fantasy 7 (planner, script writer - I was unexpectedly called upon to help out)\n\n&gt;\n\n&gt;スクウェアのイベントの作り方は、ストーリーも結構みんなで話し合って煮詰めるし、細かいサブ・イベントなんかも割り振られた担当にある程度好き勝手に作らせてしまうので\n\n&gt;The way that SQUARE creates their events is that they first discuss the story thoroughly with the entire project team, and then let each of the individual scenario writers freely\n\n&gt;\n\n&gt;FF7のクラウドが廃人になってる村とか、ライフストリーム落ちたとことか、決戦前夜のクラウドとティファのやりとりとかも、好き勝手にやらせてもらった。\n\n&gt;FF7, the village where Cloud becomes a vegetable, when he falls into the lifestream, the episode of Cloud and Tifa on the dawn before the final battle, on all of those I wrote them to my own personal tastes... er... maybe I should learn to listen more to what other people tell me (laughs).\n\nWhen did the real devs ask him to \"jump in for help\"? It must be in the very very late of 1996, after Nomura's phone call (\"Let's kill the heroine and bring mai waifu, who came from a 1993 eroge, Aoyama \"Tifa\" Misao-chan out!\") happened.\n\nI assume that phone call happened in the very very late of 1996 for two reasons:\n\n1. In the history of FF7 promos on DGPS: [https://imgur.com/a/2GQZc3C](https://imgur.com/a/2GQZc3C),\n\nIn P22, vol.37 (publication date 17th Jan. 1997), Aerith is still 神羅に追われる謎の女性 (a mysterious girl chased by Shinra). They started describing her as a tragic heroine after P24, vol.40 (publication date 14th Feb. 1997, after FF7 initial release).\n\n* 2. Even after they decided to make Aerith sacrifice herself, \"when\" and \"where\" will she sacrifice is still undecided, the current Forgotten City version is made even later of 1996, there are two articles about this:\n\n&gt;English research: [http://www.ff7citadel.com/secrets/sa\\_seen1.shtml](http://www.ff7citadel.com/secrets/sa_seen1.shtml)\n\n&gt;French research, in his opinion that gloveless Seph in CGI is from a footage which originally made for scene TRNAD\\_53.DAT.\n\n&gt;[http://ff7.fr/mysteres.php](http://ff7.fr/mysteres.php)\n\n**P9:** It seems all her part in Icicle (script name HYOUxx.DAT) were deleted AFTER Dec21, 1996. Even though two of her lines still remains.\n\n[Aerith's parts in Icicle \\(script name HYOUxx.DAT\\) were deleted AFTER Dec21, 1996](https://preview.redd.it/0ck4pjut7kfd1.png?width=1754&amp;format=png&amp;auto=webp&amp;s=7e01f275949a2b66007d045b7186452ebf8ed9ea)\n\n[Icicle1](https://preview.redd.it/vpe3i8276kfd1.jpg?width=240&amp;format=pjpg&amp;auto=webp&amp;s=469b787b957164b7340230a31b48842633eab24d)\n\n&gt;\n\n[Icicle2](https://preview.redd.it/a7hq49kc6kfd1.jpg?width=807&amp;format=pjpg&amp;auto=webp&amp;s=05bf253bdc7b465d42ecd60ed42396d7806189ae)\n\n&gt;You can find the initial JP release of FF7OG on [archive.org](http://archive.org), search for \"Final Fantasy VII (Japan) (Disc 1)\" and extract the script files with sth like UltraISO.\n\nThe sudden change of the whole story seems made the original team pretty \"busy\" and made them throw T's (re-written?) task to a newcomer Masato Kato.\n\nThere are two signs that suggest the original team cares very little about what Kato has done:\n\n[Zenogias = Xenogears, Kato's own work](https://preview.redd.it/zopg7bkk6kfd1.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=04b23b39c148878b7a03cb6c4e74c3af6e2b778b)\n\n&gt;a. When a JP editor asked the team \"Why Tifa was not Mako poisoned when she fell into LS?\", he can't get an explicit answer. (that \"Tifa has Sephiroth-class spiritual power\" was that editor's free speculation.)\n\n&gt;b. After international ver. released, an English magazine editor asked SQ what is Zenogias (Xenogears, Kato's own work) from vegetable Cloud's mouth. SQJP didn't know how to answer it properly.\n\nHere's a chart of Kato's contribution to the scripts:\n\n[masato kato](https://preview.redd.it/t4w5a02t6kfd1.png?width=736&amp;format=png&amp;auto=webp&amp;s=26f7475c2ad7dbf28ef230eb0b26495fa861c59c)\n\nITxx.DATs are Mideel related, LIFEx.DAT and ZMINDx.DAT is lifestream seq, HILL.DAT is the \"S@x under the Highwind\" thingy.\n\n=\n\nWe don't like the \"S@x under the Highwind\" idea for sure, but sadly what in the newcomer Kato's mind was most likely about that.\n\nI bet the only few knowledge he knew about T's role was she's made for semilewd pantsu jokes for fanservice, like the closet thing in her Nibel house and the thing on Shinra building stairs.\n\nThere's also one in the unused ONNA\\_3.DAT script:\n\n&gt;from [https://new.tcrf.net/Final\\_Fantasy\\_VII/Unused\\_Text](https://new.tcrf.net/Final_Fantasy_VII/Unused_Text)\n\n&gt;NPC: ひそひそ・・・・・(これさ、セブンスヘブンって🍵ちゃんのお店の裏のものほしざおからしっけいしたものさ。正真しょうめいのほんものだぜ)\n\n&gt;Psst...(Snitched these from the clothesline out back of Tifa's shop, Seventh Heaven. It's the real thing.)\n\n&gt;C: 『入手先不明パンツ』を手にいれた!\n\n&gt;Received \"Panties of Unknown Origin\"!\n\n&gt;NPC: これであんたとオレも運命きょうどうたいだな\n\n&gt;Now our destinies are intertwined.\n\n&gt;C: 子供っぽいがらのパンツだ・・・・・・。もっていれば、女装に役立つだろう\n\n&gt;The pattern on these looks like it's for kids...Might come in handy for cross-dressing.\n\n[Ultimately, her design came from a 1989/1993 p0rn game.](https://www.reddit.com/r/0/comments/1co9yq5/comment/l3cm7mo) In that p0rn her prototype, Aoyama Misao, literally has s@x on a bench at a nighttime park. It wont be a surprise if that inspired T's \"night outdoor s@x\" thing.\n\n[https://i.imgur.com/x827mog.jpeg](https://i.imgur.com/x827mog.jpeg) (pic might be considered NSFW, but not really)\n\n**P10:** That crescent earring along with her Don Corneo's bride dress are also came from that 1989/1993 p\\*rn Aoyama Misao's dress.\n\n[That crescent earring along with her Don Corneo's bride dress are also came from that 1989\\/1993 p\\*rn Aoyama Misao's dress.](https://preview.redd.it/db4r3dsa7kfd1.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=4d0214bc8d4113e69162d3b8e9a3e3437e48e4c9)\n\n**P11:** VJ(V-Jump magazine) and \"Mr. S\" from SQ made obscure joke about T's origin:\n\n[VJ and \\\\\"Mr. S\\\\\" from SQ made obscure joke about T's origin](https://preview.redd.it/9ff36u0e7kfd1.jpg?width=2001&amp;format=pjpg&amp;auto=webp&amp;s=690d965a64a142d91589670aeee18159db89a11f)\n\n&gt;「彼女はキック系の技が得意。きき足は左です。\"世界を制する黄金の左\"なんですよ」と顔をほころばせて語ってくれたのは、スクウェアのS氏。\n\n&gt;\"She is good at kicking techniques. Her left leg is her best leg. (Her left leg) has a title \"the golden left (leg) that conquers the world\"\", said Mr. S ( = Sakaguchi?) from Square, stifling a laugh (顔をほころばせて).\n\nBecause in that p0rn's catfight scene, the real origin of both Tifa's and Scarlet's design, Misao (=Tifa) used her left leg and Kaori (=Scarlet) used her hands.\n\n[Can Can Bunny Extra = きゃんきゃんバニー・エクストラ, A p0rn game released in 1993](https://preview.redd.it/xlrj9vbx6kfd1.png?width=595&amp;format=png&amp;auto=webp&amp;s=c2901e03df48de8611544ad1f161e50beb5fe539)\n\n&gt;video: [https://files.catbox.moe/g56yu1.mp4](https://files.catbox.moe/g56yu1.mp4)\n\nWhen NMR (most likely him) tried to copy this ESRB-AO originated scene to \"his own\" ESRB-E game, he made it into a \"slap fight\", maybe bacause Kaori used her hands first? (Just like the one in FF7OG Scarlet moves first.)\n\n=\n\nI wonder is there really a \"fundamental setting\" of T's character, all we can see is she got retcon'd over and over. Both her real \"origin\" and the \"meaningful parts\" of her story (by a newcomer Kato) looks like a mess.\n\nPerhaps, make her somewhat a \"victim\" is the easiest way to fool people that she's not really a fanservice character designed for semilewd jokes.",
      "author": "IncipitTragoedia0",
      "score": 100,
      "label": "positive",
      "confidence": 0.7,
      "createdUtc": "2024-07-30T01:35:57.000Z",
      "permalink": "/r/ClerithKingdom/comments/1efh3gu/light_and_darknessfrom_rclerith/",
      "ignored": false,
      "numComments": 3
    },
    {
      "id": "t3_uwn7kj",
      "type": "post",
      "subreddit": "Whitelist_Airdrop",
      "title": "Obelisk Protocol WHITELIST CAMPAIGN IS OPEN NOW",
      "body": "&amp;#x200B;\n\nhttps://preview.redd.it/xbxvor1qce191.png?width=533&amp;format=png&amp;auto=webp&amp;s=ee73905cc13515963a6b87c0669fd2ece33e7384\n\n🎪 Obelisk Protocol is a massive project that aims to combine the real world, social platform and 3D metaverse into a single mechanism using the LISK native token and GameFi approach. Obelisk protocol includes: the blockchain-based social task platform — SocialLifex, the fantasy RPG metaverse, with $Lisk currency and Play2Earn approach — LiskiaLand, as well as a game studio, a NFT marketplace and a launchpad.\n\n♻️ [SIGN UP](https://sweepwidget.com/view/57459-nsli98u1/nj3ise-57459)\n\n[To](https://sweepwidget.com/view/57459-nsli98u1/nj3ise-57459%29To) participate, you must:\n\n✔️ Fill out the form and complete all tasks.  \n✔️ Prize pool: $1500 worth $LISK + $1600 whitelist slots  \n✔️ For more information, please see the gleam.  \n✔️ Stay tuned for more updates friends, good luck!\n\nLinks to project resources: [here](https://t.co/vpzXMTaZmx) ♻️\n\nDeadline — June 6, 2022 ⏳\n\nTry to Do Your Own Research! 🤔\n\nOur Social channels is [here](https://t.co/vpzXMTaZmx) 📮\n\nGood Luck everyone! ✌🏻\n\n\\#Whitelist #Airdrop #Giveaway #GagarinLaunchpad #ObeliskProtocol",
      "author": "CoprroX100",
      "score": 80,
      "label": "positive",
      "confidence": 0.7,
      "createdUtc": "2022-05-24T09:57:47.000Z",
      "permalink": "/r/Whitelist_Airdrop/comments/uwn7kj/obelisk_protocol_whitelist_campaign_is_open_now/",
      "ignored": false,
      "numComments": 0
    },
    {
      "id": "t3_azyox3",
      "type": "post",
      "subreddit": "longevity",
      "title": "LifeX - an instagram sharing longevity research news",
      "body": "Hi guys, a couple of weeks ago I started a longevity-based instagram page called LifeX. My mission with this project is to spread as much knowledge concerning the research that is driving our quickly expanding understanding of longevity.\n\nI was motivated to start the page upon seeing the scarcity and generally poor quality of the longevity-themed pages on instagram. I take great care in only providing research-backed and up-to-date content.\n\n  \nI love this subreddit and I know not everyone is a fan of instagram but for some people it might be a good complement to the sub and to the movement in general. \n\n  \nHere's the link for everyone interested: [https://www.instagram.com/lifex\\_eu/](https://www.instagram.com/lifex_eu/)  \n ",
      "author": "lifeX_eu",
      "score": 100,
      "label": "positive",
      "confidence": 0.7,
      "createdUtc": "2019-03-11T20:58:44.000Z",
      "permalink": "/r/longevity/comments/azyox3/lifex_an_instagram_sharing_longevity_research_news/",
      "ignored": false,
      "numComments": 2
    }
  ],
  "stats": {
    "negative": 1,
    "neutral": 21,
    "positive": 8
  },
  "averageScore": 58,
  "topNegative": [
    {
      "id": "t3_1lmw1pv",
      "type": "post",
      "subreddit": "skyrizi",
      "title": "Desperately seeking option to pay for skyrizi",
      "body": "Long story short, my business partners, and I signed up for Lifex health insurance, and the only script that had to be covered was skyrizi for one of my business partners-it was in the formulary and the agent said it would be covered but since it’s a specialty medication, they just referred us to patient assistance. I feel terrible and they’re all angry at me because I had referred them to the agent as I’m in the insurance business myself and thought he was the most knowledgeable person for the job.  They are attorneys and make a lot of money so I don’t think they would qualify for anything needs based. I’m making myself crazy and haven’t slept and almost 3 days trying to find some kind of option. Talk to Skyrizi and even the Copay Assisstance card would require them to have a higher level of coverage through the insurance ",
      "author": "Nicolacrayola",
      "score": 10,
      "label": "negative",
      "confidence": 0.7,
      "createdUtc": "2025-06-28T20:06:07.000Z",
      "permalink": "/r/skyrizi/comments/1lmw1pv/desperately_seeking_option_to_pay_for_skyrizi/",
      "ignored": false,
      "numComments": 9
    }
  ],
  "countsBySubreddit": {
    "HealthInsurance": 6,
    "ChatETF": 1,
    "ETFs": 1,
    "u_Chance-Leader-2852": 1,
    "comicbookcollecting": 1,
    "DeoVR": 1,
    "xToolOfficial": 1,
    "HumanTorchMains": 1,
    "edgar_news": 1,
    "InsuranceAgent": 1,
    "skyrizi": 1,
    "Hardcore": 1,
    "investimentos": 1,
    "UFOB_Disclosures": 2,
    "BreakUps": 1,
    "Silksong": 1,
    "Jackery": 1,
    "KaynMains": 1,
    "HelloSweetDaysEn": 1,
    "askberliners": 2,
    "ClerithKingdom": 1,
    "Whitelist_Airdrop": 1,
    "longevity": 1
  },
  "totalMentions": 30,
  "lastUpdated": "2025-09-11T04:16:04.549Z"
}